Revit 2027 API
DoubleArray.Item Property
Gets or sets a double at a specified index within the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual double this[
	int index
] { get; set; }
Public Overridable Property Item (
	index As Integer
) As Double
	Get
	Set
public:
virtual property double Item[int index] {
	double get (int index);
	void set (int index, double value);
}
abstract Item : float with get, set
override Item : float with get, set
Parameters
index Int32
The index of the double to be set or retrieved.
Return Value
Double
Returns the double at the specified index.
See Also
Reference
DoubleArray Class
Autodesk.Revit.DB Namespace